[
    {
        "courseName":"Introduction to JavaScript",
        "author":"51dc7b49-b0a3-4a04-a3d0-4781d1efbedf",
        "students":[
            ["41cacde1-48d5-4374-9119-4121510741f5",[65.0,-1.0]],
            ["87410238-bbc8-4bd0-813b-9c04c25bc8e1",[98.0,-1.0]],
            ["878a27e5-78b2-499a-847e-1c60c84cf9f2",[86.0,-1.0]],
            ["1f9f3f3c-fead-4c41-b2ac-98aa2fd9ad58",[50.0,-1.0]]],
            "description":"JavaScript is a scripting language for creating dynamic web page content.",
            "language":"JavaScript",
            "modules":
            [
                [
                    [
                        "Strings",
                        "One way to use a variable is to hold text. You use key word 'var' to do this. Ex: var color = 'blue'. "
                    ],
                    [
                        "Numbers","You also use 'var' to hold numbers. You can use variables to do calculations. Ex: var size = 5. Notice how their are no quotes around the value.  "
                    ],
                    [
                        "Arrays",
                        "Arrays are used to store multiple values in a single variable. Ex: var colors = ['red', 'orange', 'yellow']. This example is an array of strings therefore each value is surrounded by quotes. Arrays are indexed starting at zero. For this example colors[0] is equal to 'red' and colors[2] is equal to 'yellow'."
                    ]
                ],
                [
                    [
                        "What is an object?",
                        "An object is a data type that can take in collections of key-value pairs. A major difference between an object and other data types such as strings and numbers in JavaScript is that an objects can store different types of data as its values."
                    ],
                    [
                        "Example",
                        "You might use an object for a user. Each user could have a first name, last name, and weight. The first and last names would be a string. The weight would be a number. Ex: var user1 = {firstName:'Ann', lastName:'Smith', weight:'125'}"
                    ],
                    [
                        "Objects and Arrays",
                        "Objects can be stored in an array. For example, to store users you could create user objects and add them to a users array."
                    ]
                ]
            ]
    }
]